app/controllers/runners_controller.rb

SELECT `runners`.* FROM `runners`
---
  def new
    @runners = Runner.all

INSERT INTO `runners` (`address1`, `address2`, `age`, `city`, `created_at`, `firstname`, `gender`, `lastname`, `phone`, `school`, `state`, `updated_at`, `zip`) VALUES ('2863 Summit Rd SW', '', '40', 'Pataskala', '2014-06-10 23:40:45', 'Brian', 'M', 'Crosby', 6145820762, 'Franklin University', 'OH', '2014-06-10 23:40:45', 43062)
---
  def create
    @runner = Runner.new(runner_params)
    if @runner.save

SELECT  "runners".* FROM "runners"  WHERE "runners"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @runner = Runner.find(params[:id])

SELECT  `runners`.* FROM `runners`  WHERE `runners`.`id` = 4 LIMIT 1
DELETE FROM `runners` WHERE `runners`.`id` = 4
---
  def destroy
    @runner = Runner.find(params[:id])
    @runner.destroy